Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: lispref/intro.texi:37 Generally speaking, the earlier chapters describe features of Emacs Lisp that have counterparts in many programming languages, and later chapters describe features that are peculiar to Emacs Lisp or relate specifically to editing.
fr_fr: D'une manière générale, les premiers chapitres décrivent les caractéristiques d'Emacs Lisp qui ont des équivalences dans beaucoup de langages de programmation, et les chapitres postérieurs décrivent les caractéristiques qui sont particulières au Emacs Lisp ou se relient spécifiquement à l'édition.

source: lispref/intro.texi:375 The function @code{foo} subtracts @var{integer1} from @var{integer2}, then adds all the rest of the arguments to the result. If @var{integer2} is not supplied, then the number 19 is used by default.
fr_fr: La fonction @code{foo} soustrait @var{integer1} de @var{integer2}, puis ajoute tout reste des arguments au résultat. Si @var{integer2} n'est pas fourni, alors le numéro 19 est appliqué par défaut.

source: lispref/intro.texi:40 This is edition @value{VERSION} of the GNU Emacs Lisp Reference Manual, corresponding to Emacs version @value{EMACSVER}.
fr_fr: C'est l'édition @value{VERSION} du manuel de référence de GNU Emacs Lisp, correspondant à la version d'Emacs @value{EMACSVER}.

source: lispref/intro.texi:402 Any argument whose name contains the name of a type (e.g., @var{integer}, @var{integer1} or @var{buffer}) is expected to be of that type. A plural of a type (such as @var{buffers}) often means a list of objects of that type. Arguments named @var{object} may be of any type. (@xref{Lisp Data Types}, for a list of Emacs object types.) Arguments with other sorts of names (e.g., @var{new-file}) are discussed specifically in the description of the function. In some sections, features common to the arguments of several functions are described at the beginning.
fr_fr: Tout argument dont le nom contient le nom d'un type (par exemple, @var{integer}, @var{integer1} ou @var{buffer}) est prévu pour être de ce type. Un pluriel d'un type (tel que @var{buffers}) signifie souvent une liste d'objets de ce type. Les arguments appelés @var{object} peuvent être de n'importe quel type. (@xref{Lisp Data Types}, pour une liste des types d'objet d'Emacs.) Des arguments avec d'autres sortes de noms (par exemple, @var{new-file}) sont discutés spécialement dans la description de la fonction. Dans quelques sections, des dispositifs communs aux arguments de plusieurs fonctions sont décrits du commencement.

source: lispref/intro.texi:405 @xref{Lambda Expressions}, for a more complete description of optional and rest arguments.
fr_fr: @xref{Lambda Expressions}, pour une description plus complète des arguments optionnels et restants.

source: lispref/intro.texi:411 Command, macro, and special form descriptions have the same format, but the word `Function' is replaced by `Command', `Macro', or `Special Form', respectively. Commands are simply functions that may be called interactively; macros process their arguments differently from functions (the arguments are not evaluated), but are presented the same way.
fr_fr: Commande, macro, et descriptions de formulaire spécial ont le même format, mais le mot `Function' est remplacé par `Command', `Macro', ou `Special Form', respectivement. Les commandes sont simplement des fonctions qui peuvent s'appeler interactivement; les macros traitent leurs arguments différemment des fonctions (les arguments ne sont pas évalués), mais sont présentés la même manière.

source: lispref/intro.texi:419 Special form descriptions use a more complex notation to specify optional and repeated arguments because they can break the argument list down into separate arguments in more complicated ways. @samp{@r{[}@var{optional-arg}@r{]}} means that @var{optional-arg} is optional and @samp{@var{repeated-args}@dots{}} stands for zero or more arguments. Parentheses are used when several arguments are grouped into additional levels of list structure. Here is an example:
fr_fr: Les descriptions de formulaire spécial emploient une notation plus complexe pour indiquer des arguments facultatifs et répétés parce qu'elles peuvent démonter la liste d'argument en arguments séparés de manières plus compliquées. @samp{@r{[}@var{optional-arg}@r{]}} signifie que @var{optional-arg} est facultatif et @samp{@var{reapeated-args}@dots{}} représente zéro arguments ou plus. Des parenthèses sont employées quand plusieurs arguments sont groupés dans les niveaux additionnels de la structure de liste. Voici un exemple :

source: lispref/intro.texi:427 This imaginary special form implements a loop that executes the @var{body} forms and then increments the variable @var{var} on each iteration. On the first iteration, the variable has the value @var{from}; on subsequent iterations, it is incremented by one (or by @var{inc} if that is given). The loop exits before executing @var{body} if @var{var} equals @var{to}. Here is an example:
fr_fr: Ce formulaire spécial imaginaire met en application une boucle qui exécute la forme @var{body} et qui ensuite incrémente la variable @var{var} à chacun itération. Sur la première itération, la variable a la valeur @var{from} ; sur des itérations suivantes, elle est incrémentée de un (ou par @var{inc} si elle est donnée). La boucle est arrêtée avant l'exécution de @var{body} si @var{var} est égale à @var{to}. Voici un exemple :

source: lispref/intro.texi:438 If @var{from} and @var{to} are omitted, @var{var} is bound to @code{nil} before the loop begins, and the loop exits if @var{var} is non-@code{nil} at the beginning of an iteration. Here is an example:
fr_fr: Si @var{from} et @var{to} sont omis, @var{var} est lié à @code{nil} avant que la boucle commence, et la boucle est arrêtée si @var{var} est non-@code{nil} au début d'une itération. Voici un exemple :

source: lispref/intro.texi:451 In this special form, the arguments @var{from} and @var{to} are optional, but must both be present or both absent. If they are present, @var{inc} may optionally be specified as well. These arguments are grouped with the argument @var{var} into a list, to distinguish them from @var{body}, which includes all remaining elements of the form.
fr_fr: Sous ce formulaire spécial, les arguments @var{from} et @var{to} sont facultatif, mais il faut qu'ils soient tous deux présents ou tous deux absents. S'ils sont présents, @var{inc} peut aussi bien être indiqué optionnellement. Ces arguments sont groupés avec l'argument @var{var} dans une liste, pour les distinguer de @var{body}, qui inclut tous les éléments restants de la forme.

source: lispref/intro.texi:463 A @dfn{variable} is a name that can hold a value. Although nearly all variables can be set by the user, certain variables exist specifically so that users can change them; these are called @dfn{user options}. Ordinary variables and user options are described using a format like that for functions except that there are no arguments.
fr_fr: Une @dfn{variable} est un nom qui peut contenir une valeur. Bien que presque toutes les variables puissent être initialisées par l'utilisateur, certaines variables existent spécifiquement de sorte que les utilisateurs puissent les changer ; celles-ci s'appellent @dfn{users options}. Des variables ordinaires et les options d'utilisateur sont décrites en utilisant un format comme pour des fonctions sauf qu'il n'y a aucun argument.

source: lispref/intro.texi:471 The value of this variable is a full keymap used by Electric Command Future mode. The functions in this map allow you to edit commands you have not yet thought about executing.
fr_fr: La valeur de cette variable est une keymap employé par le mode Electric Command Future. Les fonctions dans cette map vous permettent d'éditer des commandes auxquelles vous n'avez pas avez encore pensé.

source: lispref/intro.texi:475 User option descriptions have the same format, but `Variable' is replaced by `User Option'.
fr_fr: Les descriptions d'option d'utilisateur ont le même format, mais le mot `Variable' est remplacée par `User Option'.

source: lispref/intro.texi:481 These facilities provide information about which version of Emacs is in use.
fr_fr: Ces fonctions fournissent les informations au sujet de la version d'Emacs en service.

source: lispref/intro.texi:485 This function returns a string describing the version of Emacs that is running. It is useful to include this string in bug reports.
fr_fr: Cette fonction renvoie une chaine décrivant la version d'Emacs qui est en fonction. Il est utile d'inclure cette chaine dans des rapports de bogue.

source: lispref/intro.texi:491 (emacs-version) @result{} "GNU Emacs 20.3.5 (i486-pc-linux-gnulibc1, X toolkit) of Sat Feb 14 1998 on psilocin.gnu.org"
fr_fr: (emacs-version) @result{} "GNU Emacs 20.3.5 (i486-pc-linux-gnulibc1, X toolkit) of Sat Feb 14 1998 on psilocin.gnu.org"

source: lispref/intro.texi:498 If @var{here} is non-@code{nil}, it inserts the text in the buffer before point, and returns @code{nil}. Called interactively, the function prints the same information in the echo area, but giving a prefix argument makes @var{here} non-@code{nil}.
fr_fr: Si @var{here} est non-@code{nil}, ça insère le texte dans le tampon avant le point, et renvoie le @code{nil}. Appelée interactivement, la fonction affiche la même information dans le secteur d'écho, mais en donnant un argument de préfixe rend @var{here} non-@code{nil}.

source: lispref/intro.texi:504 The value of this variable indicates the time at which Emacs was built at the local site. It is a list of three integers, like the value of @code{current-time} (@pxref{Time of Day}).
fr_fr: La valeur de cette variable indique le moment où Emacs a été construit à l'emplacement local. C'est une liste de trois nombres entiers, comme la valeur de @code{current-time} (@pxref{Time of Day}).

source: lispref/intro.texi:520 The value of this variable is the version of Emacs being run. It is a string such as @code{"20.3.1"}. The last number in this string is not really part of the Emacs release version number; it is incremented each time you build Emacs in any given directory. A value with four numeric components, such as @code{"20.3.9.1"}, indicates an unreleased test version.
fr_fr: La valeur de cette variable est la version d'Emacs en cours. C'est une chaine telle que @code{"20.3.1"}. Le dernier nombre dans cette chaine n'est pas vraiment une partie du nombre de version de sortie d'Emacs; il est incrémenté chaque fois que vous construisez Emacs dans n'importe quel répertoire donné. Une valeur avec quatre composants numériques, tels que @code{"20.3.9.1"}, indique une version d'essai non sortie.

source: lispref/intro.texi:527 The major version number of Emacs, as an integer. For Emacs version 20.3, the value is 20.
fr_fr: Le numéro principal de version d'Emacs, comme nombre entier. Pour la version 20.3 d'Emacs, la valeur est 20.

source: lispref/intro.texi:532 The minor version number of Emacs, as an integer. For Emacs version 20.3, the value is 3.
fr_fr: Le numéro de version mineur d'Emacs, comme nombre entier. Pour la version 20.3 d'Emacs, la valeur est 3.

source: lispref/intro.texi:544 This manual was written by Robert Krawitz, Bil Lewis, Dan LaLiberte, Richard@tie{}M. Stallman and Chris Welty, the volunteers of the GNU manual group, in an effort extending over several years. Robert@tie{}J. Chassell helped to review and edit the manual, with the support of the Defense Advanced Research Projects Agency, ARPA Order 6082, arranged by Warren@tie{}A. Hunt, Jr.@: of Computational Logic, Inc.
fr_fr: Ce manuel a été écrit par Robert Krawitz, Bil Lewis, Dan LaLiberte, Richard M. Stallman and Chris Welty, les volontaires du groupe GNU manual, dans un effort se prolongeant sur plusieurs années. Robert J. Chassell a aidé à passer en revue et éditer le manuel, avec l'appui de la Defense Advanced Research Projects Agency, ARPA Ordre 6082, avec l'accord de Warren A. Hunt, Jr.@: de Computational Logic, Inc.

source: lispref/intro.texi:557 Corrections were supplied by Karl Berry, Jim Blandy, Bard Bloom, Stephane Boucher, David Boyes, Alan Carroll, Richard Davis, Lawrence R. Dodd, Peter Doornbosch, David A. Duff, Chris Eich, Beverly Erlebacher, David Eckelkamp, Ralf Fassel, Eirik Fuller, Stephen Gildea, Bob Glickstein, Eric Hanchrow, George Hartzell, Nathan Hess, Masayuki Ida, Dan Jacobson, Jak Kirman, Bob Knighten, Frederick M. Korz, Joe Lammens, Glenn M. Lewis, K. Richard Magill, Brian Marick, Roland McGrath, Skip Montanaro, John Gardiner Myers, Thomas A. Peterson, Francesco Potorti, Friedrich Pukelsheim, Arnold D. Robbins, Raul Rockwell, Per Starb@"ack, Shinichirou Sugou, Kimmo Suominen, Edward Tharp, Bill Trost, Rickard Westman, Jean White, Matthew Wilding, Carl Witty, Dale Worley, Rusty Wright, and David D. Zuhn.
fr_fr: Les corrections ont été fournies par Karl Berry, Jim Blandy, Bard Bloom, Stephane Boucher, David Boyes, Alan Carroll, Richard Davis, Lawrence R. Dodd, Peter Doornbosch, David A. Duff, Chris Eich, Beverly Erlebacher, David Eckelkamp, Ralf Fassel, Eirik Fuller, Stephen Gildea, Bob Glickstein, Eric Hanchrow, George Hartzell, Nathan Hess, Masayuki Ida, Dan Jacobson, Jak Kirman, Bob Knighten, Frederick M. Korz, Joe Lammens, Glenn M. Lewis, K. Richard Magill, Brian Marick, Roland McGrath, Skip Montanaro, John Gardiner Myers, Thomas A. Peterson, Francesco Potorti, Friedrich Pukelsheim, Arnold D. Robbins, Raul Rockwell, Per Starbäck, Shinichirou Sugou, Kimmo Suominen, Edward Tharp, Bill Trost, Rickard Westman, Jean White, Matthew Wilding, Carl Witty, Dale Worley, Rusty Wright, et David D. Zuhn.

source: lispref/intro.texi:59 This manual has gone through numerous drafts. It is nearly complete but not flawless. There are a few topics that are not covered, either because we consider them secondary (such as most of the individual modes) or because they are yet to be written. Because we are not able to deal with them completely, we have left out several parts intentionally. This includes most information about usage on VMS.
fr_fr: Ce manuel est passé par de nombreuses ébauches. Il est presque complet mais non impeccable. Il y a quelques matières qui ne sont pas couvertes parce que nous les considérons secondaires (comme la plupart des différents modes) ou parce qu'elles doivent encore être écrites. Puisque nous ne pouvons pas les traiter complètement, nous avons omis plusieurs parties intentionnellement. Ceci inclut la plupart des informations sur l'utilisation de VMS.

source: lispref/intro.texi:66 The manual should be fully correct in what it does cover, and it is therefore open to criticism on anything it says---from specific examples and descriptive text, to the ordering of chapters and sections. If something is confusing, or you find that you have to look at the sources or experiment to learn something not covered in the manual, then perhaps the manual should be fixed. Please let us know.
fr_fr: Le manuel devrait être entièrement correct dans ce qu'il couvre, et il est donc soumis à la critique sur tout ce qu'il indique---des exemples spécifiques et du texte descriptif, à l'ordre des chapitres et des sections---. Si quelque chose est embrouillé, ou si vous constatez que vous devez regarder les sources ou expérimenter pour apprendre quelque chose non couvert dans le manuel, alors peut-être faudrait-il l'inclure dans le manuel. Merci de nous faire le savoir.

source: lispref/intro.texi:76 As you use this manual, we ask that you mark pages with corrections so you can later look them up and send them to us. If you think of a simple, real-life example for a function or group of functions, please make an effort to write it up and send it in. Please reference any comments to the chapter name, section name, and function name, as appropriate, since page numbers and chapter and section numbers will change and we may have trouble finding the text you are talking about. Also state the number of the edition you are criticizing.
fr_fr: Quand vous employez ce manuel, nous vous demandons de marquer les pages avec les corrections ainsi vous pouvez plus tard les rechercher et nous les envoyer. Si vous pensez à un exemple simple et réel pour une fonction ou au groupe de fonctions, merci de faire l'effort de l'écrire et de l'envoyer. Veuillez mettre en référence tous les commentaires au nom de chapitre, nom de section, et le nom de fonction, comme approprié, puisque les numéros de page et les nombres de chapitre et de section changeront et nous aurions des problèmes pour trouver le texte dont vous parlez. Énoncer en outre le numéro de l'édition que vous critiquez.

source: lispref/intro.texi:85 As you use this manual, we ask that you send corrections as soon as you find them. If you think of a simple, real life example for a function or group of functions, please make an effort to write it up and send it in. Please reference any comments to the node name and function or variable name, as appropriate. Also state the number of the edition you are criticizing.
fr_fr: Quand vous vous servez de ce manuel, nous vous demandons d'envoyez les corrections dès que vous en trouverez. Si vous pensez à un exemple simple et réel pour une fonction ou au groupe de fonctions, merci de faire l'effort de l'écrire et de l'envoyer. Veuillez mettre en référence tous les commentaires du nom du noeud et la fonction ou le nom de la variable, comme approprié. Énoncer en outre le numéro de l'édition que vous critiquez.

source: lispref/macros.texi:437 @result{} for
fr_fr: @result{} for

source: lispref/numbers.texi:1004 This function returns the ``exclusive or'' of its arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in an odd number of the arguments. If there are no arguments, the result is 0, which is an identity element for this operation. If @code{logxor} is passed just one argument, it returns that argument.
fr_fr: Cette fonction renvoie le ``ou exclusif'' de ses arguments: le @var{n}ième bit est placé dans le résultat si, et seulement si, le bit @var{n}ième bit est placé dans un nombre impair des arguments. S'il n'y a aucun argument, le résultat est 0, qui est un élément d'identité pour cette opération. Si @code{logxor} est passé juste à un argument, il renvoie cet argument.

source: lispref/numbers.texi:1012 (logxor 12 5) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 9 ; 9 = @r{0 0000 0000 0000 0000 0000 0000 1001}
fr_fr: (logxor 12 5) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 9 ; 9 = @r{0 0000 0000 0000 0000 0000 0000 1001}

source: lispref/numbers.texi:1019 (logxor 12 5 7) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ; 7 = @r{0 0000 0000 0000 0000 0000 0000 0111} @result{} 14 ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110}
fr_fr: (logxor 12 5 7) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ; 7 = @r{0 0000 0000 0000 0000 0000 0000 0111} @result{} 14 ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110}

source: lispref/numbers.texi:1027 This function returns the logical complement of its argument: the @var{n}th bit is one in the result if, and only if, the @var{n}th bit is zero in @var{integer}, and vice-versa.
fr_fr: Cette fonction renvoie le complément logique de son argument: le @var{n}ième bit est 1 dans le résultat si, et seulement si, le @var{n}ième bit est 0 dans @var{integer}, et vice-versa.

source: lispref/numbers.texi:1034 (lognot 5) @result{} -6 ;; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ;; @r{becomes} ;; -6 = @r{1 1111 1111 1111 1111 1111 1111 1010}
fr_fr: (lognot 5) @result{} -6 ;; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ;; @r{devient} ;; -6 = @r{1 1111 1111 1111 1111 1111 1111 1010}

source: lispref/numbers.texi:1045 These mathematical functions allow integers as well as floating point numbers as arguments.
fr_fr: Ces fonctions mathématiques autorisent des nombres entiers aussi bien que des nombres à virgule flottante comme arguments.

source: lispref/numbers.texi:105 (We have inserted spaces between groups of 4 bits, and two spaces between groups of 8 bits, to make the binary integer easier to read.)
fr_fr: (Nous avons inséré un espace entre les groupes de 4 bits, et deux espaces entre les groupes de 8 bits, pour faciliter la lecture du nombre entier binaire.)

source: lispref/numbers.texi:1051 These are the ordinary trigonometric functions, with argument measured in radians.
fr_fr: Ce sont les fonctions trigonométriques ordinaires, avec l'argument mesuré en radians.

source: lispref/numbers.texi:1070 (inclusive) whose sine is @var{arg}; if, however, @var{arg} is out of range (outside [@minus{}1, 1]), it signals a @code{domain-error} error.
fr_fr: (inclus) dont le sinus est @var{arg} ; si, cependant, @var{arg} est hors de portée (en dehors de [@minus{} 1, 1]), il signale une erreur @code{domaine-error}.

source: lispref/numbers.texi:1082 (inclusive) whose cosine is @var{arg}; if, however, @var{arg} is out of range (outside [@minus{}1, 1]), it signals a @code{domain-error} error.
fr_fr: (inclus) dont le cosinus est @var{arg} ; si, cependant, @var{arg} est hors de portée (en dehors de [@minus{} 1, 1]), il signale une erreur @code{domaine-error}.

source: lispref/numbers.texi:1103 (exclusive) whose tangent is @var{y}. If the optional second argument @var{x} is given, the value of @code{(atan y x)} is the angle in radians between the vector @code{[@var{x}, @var{y}]} and the @code{X} axis.
fr_fr: (exclusif) dont la tangente est @var{y}. Si le deuxième argument facultatif @var{x} est donné, la valeur de @code{(atan y x)} est pêcher en radians entre le vecteur @code{[@var{x}, @var{y}]} et l'axis @code{X}.

source: lispref/numbers.texi:1122 is a fundamental mathematical constant also called the base of natural logarithms.
fr_fr: est une constante mathématique fondamentale également appelée base des logarithmes naturels.

source: lispref/numbers.texi:1127 This function returns the logarithm of @var{arg}, with base @var{base}. If you don't specify @var{base}, the base
fr_fr: Cette fonction renvoie le logarithme de @var{arg}, en base @var{base}. Si vous n'indiquez pas @var{base}, la base

source: lispref/numbers.texi:1135 is used. If @var{arg} is negative, it signals a @code{domain-error} error.
fr_fr: est employée. Si @var{arg} est négatif, il signale une erreur @code{domain-error}.

source: lispref/numbers.texi:1156 This function returns the logarithm of @var{arg}, with base 10. If @var{arg} is negative, it signals a @code{domain-error} error. @code{(log10 @var{x})} @equiv{} @code{(log @var{x} 10)}, at least approximately.
fr_fr: Cette fonction renvoie le logarithme de @var{arg}, en base 10. Si @var{arg} est négatif, il signale une erreur @code{domain-error}. @code{(log10 @var{x})} @equiv{} @code{(log @var{x} 10)}, au moins approximativement.

source: lispref/numbers.texi:116 @minus{}1 is represented as 29 ones. (This is called @dfn{two's complement} notation.)
fr_fr: @minus{}1 est représenté en tant que 29 unités. (Ceci s'appelle la notation @dfn{two's complement}.)

source: lispref/numbers.texi:1162 This function returns @var{x} raised to power @var{y}. If both arguments are integers and @var{y} is positive, the result is an integer; in this case, overflow causes truncation, so watch out.
fr_fr: Cette fonction renvoie @var{x} à la puissance @var{y}. Si tout les deux les arguments sont des nombres entiers et @var{y} est positif, le résultat est nombre entier ; dans ce cas, le débordement cause l'abrèviation, alors attention.
